7767517
256 306
Input                    in0                      0 1 in0
Convolution              conv_1                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_84                  1 1 1 2
Convolution              conv_2                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_85                  1 1 3 4
Convolution              conv_3                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_86                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_4                   1 1 11 12 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_87                  1 1 12 13
Convolution              conv_5                   1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_88                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_6                   1 1 17 18 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_89                  1 1 18 19
Convolution              conv_7                   1 1 19 20 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_90                  1 1 20 21
Convolution              conv_8                   1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_91                  1 1 22 23
Slice                    split_1                  1 2 23 24 25 -23300=2,32,32 1=0
Split                    splitncnn_1              1 3 25 26 27 28
Convolution              conv_9                   1 1 28 29 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_92                  1 1 29 30
Convolution              conv_10                  1 1 30 31 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_93                  1 1 31 32
BinaryOp                 add_1                    2 1 27 32 33 0=0
Concat                   cat_1                    3 1 24 26 33 34 0=0
Convolution              conv_11                  1 1 34 35 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_94                  1 1 35 36
Split                    splitncnn_2              1 2 36 37 38
Convolution              conv_12                  1 1 38 39 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_95                  1 1 39 40
Convolution              conv_13                  1 1 40 41 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_96                  1 1 41 42
Slice                    split_2                  1 2 42 43 44 -23300=2,64,64 1=0
Split                    splitncnn_3              1 3 44 45 46 47
Convolution              conv_14                  1 1 47 48 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_97                  1 1 48 49
Split                    splitncnn_4              1 2 49 50 51
Convolution              conv_15                  1 1 51 52 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_98                  1 1 52 53
Convolution              conv_16                  1 1 53 54 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_99                  1 1 54 55
BinaryOp                 add_2                    2 1 50 55 56 0=0
Split                    splitncnn_5              1 2 56 57 58
Convolution              conv_17                  1 1 58 59 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_100                 1 1 59 60
Convolution              conv_18                  1 1 60 61 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_101                 1 1 61 62
BinaryOp                 add_3                    2 1 57 62 63 0=0
Convolution              conv_19                  1 1 46 64 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_102                 1 1 64 65
Concat                   cat_2                    2 1 63 65 66 0=0
Convolution              conv_20                  1 1 66 67 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_103                 1 1 67 68
Concat                   cat_3                    3 1 43 45 68 69 0=0
Convolution              conv_21                  1 1 69 70 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_104                 1 1 70 71
Split                    splitncnn_6              1 2 71 72 73
Convolution              conv_22                  1 1 73 74 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_105                 1 1 74 75
Convolution              conv_23                  1 1 75 76 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_106                 1 1 76 77
Slice                    split_3                  1 2 77 78 79 -23300=2,128,128 1=0
Split                    splitncnn_7              1 3 79 80 81 82
Convolution              conv_24                  1 1 82 83 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_107                 1 1 83 84
Split                    splitncnn_8              1 2 84 85 86
Convolution              conv_25                  1 1 86 87 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_108                 1 1 87 88
Convolution              conv_26                  1 1 88 89 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_109                 1 1 89 90
BinaryOp                 add_4                    2 1 85 90 91 0=0
Split                    splitncnn_9              1 2 91 92 93
Convolution              conv_27                  1 1 93 94 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_110                 1 1 94 95
Convolution              conv_28                  1 1 95 96 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_111                 1 1 96 97
BinaryOp                 add_5                    2 1 92 97 98 0=0
Convolution              conv_29                  1 1 81 99 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_112                 1 1 99 100
Concat                   cat_4                    2 1 98 100 101 0=0
Convolution              conv_30                  1 1 101 102 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_113                 1 1 102 103
Concat                   cat_5                    3 1 78 80 103 104 0=0
Convolution              conv_31                  1 1 104 105 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_114                 1 1 105 106
Convolution              conv_32                  1 1 106 107 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Split                    splitncnn_10             1 2 107 108 109
Pooling                  maxpool2d_81             1 1 109 110 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_11             1 2 110 111 112
Pooling                  maxpool2d_82             1 1 112 113 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_12             1 2 113 114 115
Pooling                  maxpool2d_83             1 1 115 116 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_6                    4 1 108 111 114 116 117 0=0
Convolution              conv_33                  1 1 117 118 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_115                 1 1 118 119
Convolution              conv_34                  1 1 119 120 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_116                 1 1 120 121
Slice                    split_4                  1 2 121 122 123 -23300=2,128,128 1=0
Split                    splitncnn_13             1 2 123 124 125
Convolution              conv_35                  1 1 125 126 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Split                    splitncnn_14             1 3 126 127 128 129
Reshape                  view_162                 1 1 129 130 0=-1 1=128 2=2
Slice                    split_5                  1 3 130 131 132 133 -23300=3,32,32,64 1=1
Split                    splitncnn_15             1 2 133 134 135
Permute                  transpose_168            1 1 131 136 0=1
MatMul                   matmul_166               2 1 136 132 137
BinaryOp                 mul_6                    1 1 137 138 0=2 1=1 2=1.767770e-01
Softmax                  softmax_0                1 1 138 139 0=2 1=1
MatMul                   matmultransb_0           2 1 135 139 140 0=1
Reshape                  Tensor.view_6            2 1 140 127 141 6="1w,1h,128"
Reshape                  Tensor.reshape_4         2 1 134 128 142 6="1w,1h,128"
ConvolutionDepthWise     convdw_173               1 1 142 143 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
BinaryOp                 add_7                    2 1 141 143 144 0=0
Convolution              conv_36                  1 1 144 145 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_8                    2 1 124 145 146 0=0
Split                    splitncnn_16             1 2 146 147 148
Convolution              conv_37                  1 1 148 149 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_117                 1 1 149 150
Convolution              conv_38                  1 1 150 151 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_9                    2 1 147 151 152 0=0
Concat                   cat_7                    2 1 122 152 153 0=0
Convolution              conv_39                  1 1 153 154 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_118                 1 1 154 155
Split                    splitncnn_17             1 2 155 156 157
Interp                   upsample_160             1 1 157 158 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_8                    2 1 158 72 159 0=0
Convolution              conv_40                  1 1 159 160 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_119                 1 1 160 161
Slice                    split_6                  1 2 161 162 163 -23300=2,64,64 1=0
Split                    splitncnn_18             1 3 163 164 165 166
Convolution              conv_41                  1 1 166 167 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_120                 1 1 167 168
Convolution              conv_42                  1 1 168 169 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_121                 1 1 169 170
BinaryOp                 add_10                   2 1 165 170 171 0=0
Concat                   cat_9                    3 1 162 164 171 172 0=0
Convolution              conv_43                  1 1 172 173 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_122                 1 1 173 174
Split                    splitncnn_19             1 2 174 175 176
Interp                   upsample_161             1 1 176 177 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_10                   2 1 177 37 178 0=0
Convolution              conv_44                  1 1 178 179 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_123                 1 1 179 180
Slice                    split_7                  1 2 180 181 182 -23300=2,32,32 1=0
Split                    splitncnn_20             1 3 182 183 184 185
Convolution              conv_45                  1 1 185 186 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_124                 1 1 186 187
Convolution              conv_46                  1 1 187 188 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_125                 1 1 188 189
BinaryOp                 add_11                   2 1 184 189 190 0=0
Concat                   cat_11                   3 1 181 183 190 191 0=0
Convolution              conv_47                  1 1 191 192 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_126                 1 1 192 193
Split                    splitncnn_21             1 3 193 194 195 196
Convolution              conv_48                  1 1 195 197 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_127                 1 1 197 198
Concat                   cat_12                   2 1 198 175 199 0=0
Convolution              conv_49                  1 1 199 200 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_128                 1 1 200 201
Slice                    split_8                  1 2 201 202 203 -23300=2,64,64 1=0
Split                    splitncnn_22             1 3 203 204 205 206
Convolution              conv_50                  1 1 206 207 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_129                 1 1 207 208
Convolution              conv_51                  1 1 208 209 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_130                 1 1 209 210
BinaryOp                 add_12                   2 1 205 210 211 0=0
Concat                   cat_13                   3 1 202 204 211 212 0=0
Convolution              conv_52                  1 1 212 213 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_131                 1 1 213 214
Split                    splitncnn_23             1 3 214 215 216 217
Convolution              conv_53                  1 1 216 218 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_132                 1 1 218 219
Concat                   cat_14                   2 1 219 156 220 0=0
Convolution              conv_54                  1 1 220 221 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_133                 1 1 221 222
Slice                    split_9                  1 2 222 223 224 -23300=2,128,128 1=0
Split                    splitncnn_24             1 3 224 225 226 227
Convolution              conv_55                  1 1 227 228 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_134                 1 1 228 229
Split                    splitncnn_25             1 2 229 230 231
Convolution              conv_56                  1 1 231 232 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_135                 1 1 232 233
Convolution              conv_57                  1 1 233 234 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_136                 1 1 234 235
BinaryOp                 add_13                   2 1 230 235 236 0=0
Split                    splitncnn_26             1 2 236 237 238
Convolution              conv_58                  1 1 238 239 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_137                 1 1 239 240
Convolution              conv_59                  1 1 240 241 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_138                 1 1 241 242
BinaryOp                 add_14                   2 1 237 242 243 0=0
Convolution              conv_60                  1 1 226 244 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_139                 1 1 244 245
Concat                   cat_15                   2 1 243 245 246 0=0
Convolution              conv_61                  1 1 246 247 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_140                 1 1 247 248
Concat                   cat_16                   3 1 223 225 248 249 0=0
Convolution              conv_62                  1 1 249 250 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_141                 1 1 250 251
Split                    splitncnn_27             1 2 251 252 253
Convolution              conv_63                  1 1 194 254 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_142                 1 1 254 255
Convolution              conv_64                  1 1 255 256 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_143                 1 1 256 257
Convolution              conv_65                  1 1 257 258 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_174               1 1 196 259 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_144                 1 1 259 260
Convolution              conv_66                  1 1 260 261 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_145                 1 1 261 262
ConvolutionDepthWise     convdw_175               1 1 262 263 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_146                 1 1 263 264
Convolution              conv_67                  1 1 264 265 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_147                 1 1 265 266
Convolution              conv_68                  1 1 266 267 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Concat                   cat_17                   2 1 258 267 268 0=0
Convolution              conv_69                  1 1 215 269 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_148                 1 1 269 270
Convolution              conv_70                  1 1 270 271 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_149                 1 1 271 272
Convolution              conv_71                  1 1 272 273 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_176               1 1 217 274 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_150                 1 1 274 275
Convolution              conv_72                  1 1 275 276 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_151                 1 1 276 277
ConvolutionDepthWise     convdw_177               1 1 277 278 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_152                 1 1 278 279
Convolution              conv_73                  1 1 279 280 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_153                 1 1 280 281
Convolution              conv_74                  1 1 281 282 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Concat                   cat_18                   2 1 273 282 283 0=0
Convolution              conv_75                  1 1 252 284 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_154                 1 1 284 285
Convolution              conv_76                  1 1 285 286 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_155                 1 1 286 287
Convolution              conv_77                  1 1 287 288 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_178               1 1 253 289 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_156                 1 1 289 290
Convolution              conv_78                  1 1 290 291 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_157                 1 1 291 292
ConvolutionDepthWise     convdw_179               1 1 292 293 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_158                 1 1 293 294
Convolution              conv_79                  1 1 294 295 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_159                 1 1 295 296
Convolution              conv_80                  1 1 296 297 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Concat                   cat_19                   2 1 288 297 298 0=0
Reshape                  view_163                 1 1 268 299 0=-1 1=65
Permute                  transpose_170            1 1 299 300 0=1
Reshape                  view_164                 1 1 283 301 0=-1 1=65
Permute                  transpose_171            1 1 301 302 0=1
Reshape                  view_165                 1 1 298 303 0=-1 1=65
Permute                  transpose_172            1 1 303 304 0=1
Concat                   cat_20                   3 1 300 302 304 out0 0=0
